/*
文件名称: appE2PROM.c
功能:
    1.包含appE2PROM应用层处理相关的函数
作者: 杜在连
修改记录:
    2017-5-15 文件初创
备注:   void
注意:   void
 */
#include "include.h"



/******************************************宏定义*************************************************/

/*******************************************声明**************************************************/

/*****************************************变量定义************************************************/

/******************************************函数定义***********************************************/
/****************************************static函数定义*********************************************/

/****************************************extern函数定义*********************************************/

/*
名称: E2Default()
功能:
    1.E2PROM 恢复出厂设置
参数:   void
返回值: void
输入:   void
输出:   void
备注:   void
注意:   void
*/
void E2Default(stRtuCfgDef *pstCfg)
{
    NetDefault();
    SenDefault();
    EEPROM_Write(0, (uint8_t *)pstCfg, sizeof(stRtuCfgDef));
    return;
}

/*
名称: E2ReadCfg()
功能:
    1.从E2PROM中读取RTU配置参数
参数:   void
返回值: void
输入:   void
输出:   void
备注:   void
注意:   void
*/
void E2ReadCfg(stRtuCfgDef *pstCfg)
{
    EEPROM_Read(0, (uint8_t *)pstCfg, sizeof(stRtuCfgDef));
    return;
}

